jcvsite/Solar-monitoring-viewer-esp32/src/main.cpp
#include <Arduino.h>
#include <math.h>
#include <time.h>
#include <vector>
#include <TFT_eSPI.h>
#include <WiFi.h>
#include <WiFiManager.h>
#include <SPI.h>

#include "config.h"
#include "secrets.h"
#include "settings_store.h"
#include "api_client.h"
#include "discovery.h"
#include "touch_input.h"
#include "ui.h"
#include "theme.h"
#include "layout.h"
#include "git_ota.h"
#include "device_web.h"
#include "wifi_setup.h"

#ifndef FW_VERSION
#define FW_VERSION "0.0.0"
#endif

TFT_eSPI tft;

SettingsStore store;
ApiClient api;
Discovery discovery;
Ui ui;

HostSettings settings;
GlanceData glance;
BmsData bms;
HistoryData history;

Page page = Page::Glance;
SettingsTab settingsTab = SettingsTab::Connection;
uint32_t lastPoll = 0;
uint32_t lastConfigPoll = 0;
uint32_t lastGood = 0;
uint32_t lastAnim = 0;
String statusMsg = "Boot";
String otaStatus = "Ready";
bool needRedraw = true;
std::vector<DiscoveredHost> found;
int foundIndex = 0;
uint8_t manualOctets[4] = {192, 168, 1, 240};
uint8_t manualSel = 0;

std::vector<WifiNetwork> wifiNets;
int wifiScroll = 0;
int wifiSelected = 0;
String wifiPickSsid;
String wifiPassword;
bool wifiShowPass = false;
bool wifiShift = false;
String wifiStatus;

bool settingsPinUnlocked = false;
String pinEntry;
String pinStatus;
String pinSetFirst;
uint8_t pinSetPhase = 0;
Page pinReturnPage = Page::Glance;

static const char* kLayoutNames[] = {"Classic", "Compact", "Ring", "Bars", "Flow"};
static const char* kThemeNames[] = {"Dark", "Light", "Solar", "Ocean", "Forest"};

static void pollIfDue(bool force);
static void pollDisplayConfig(bool force);

static const char* rotationLabel(uint8_t r) {
  switch (r & 3) {
    case 1:
      return "Landscape";
    case 2:
      return "Portrait flip";
    case 3:
      return "Landscape flip";
    default:
      return "Portrait";
  }
}

static void applyHostSettingsFromConfig(const DisplayConfig& cfg);

static void startWifiScan() {
  wifiStatus = "Scanning...";
  needRedraw = true;
  ui.drawWifiNetworks(tft, wifiNets, wifiScroll, wifiSelected, wifiStatus);
  if (wifiScanNetworks(wifiNets)) {
    wifiScroll = 0;
    wifiSelected = 0;
    wifiStatus = "Tap your network";
  } else {
    wifiNets.clear();
    wifiStatus = "No networks — tap Rescan";
  }
  needRedraw = true;
}

static bool connectPickedWifi(const String& ssid, const String& pass) {
  wifiStatus = "Connecting...";
  needRedraw = true;
  ui.drawSplash(tft, wifiStatus.c_str());
  if (!wifiConnectAndSave(ssid.c_str(), pass.c_str())) {
    wifiStatus = "Failed — check password";
    return false;
  }
  wifiStatus = "Connected " + WiFi.localIP().toString();
  deviceWeb.applySettings(settings);
  deviceWeb.begin();
  ui.ensureClock();
  return true;
}

static bool nearEq(float a, float b) {
  if (isnan(a) && isnan(b)) return true;
  if (isnan(a) || isnan(b)) return false;
  return fabsf(a - b) < 1.0f;
}

static bool glanceVisualEqual(const GlanceData& a, const GlanceData& b) {
  return a.title == b.title && a.grid_state == b.grid_state && a.batt_status == b.batt_status &&
         a.batt_time == b.batt_time && a.status == b.status && nearEq(a.soc, b.soc) &&
         nearEq(a.batt_w, b.batt_w) && nearEq(a.pv_w, b.pv_w) && nearEq(a.load_w, b.load_w) &&
         nearEq(a.grid_w, b.grid_w) && nearEq(a.pv_today_kwh, b.pv_today_kwh) &&
         nearEq(a.load_today_kwh, b.load_today_kwh);
}

static bool glanceGridAlert(const GlanceData& g) {
  if (!settings.gridOfflineAlert) return false;
  return g.grid_state == "offline" || g.grid_state == "brownout";
}

static void loadManualOctetsFromSettings() {
  if (settings.hostIp.length()) {
    int start = 0;
    for (int i = 0; i < 4; i++) {
      int dot = settings.hostIp.indexOf('.', start);
      String part = (dot >= 0) ? settings.hostIp.substring(start, dot) : settings.hostIp.substring(start);
      manualOctets[i] = (uint8_t)constrain(part.toInt(), 0, 255);
      if (dot < 0) break;
      start = dot + 1;
    }
  } else {
    IPAddress lip = WiFi.localIP();
    manualOctets[0] = 192;
    manualOctets[1] = 168;
    manualOctets[2] = 1;
    manualOctets[3] = 240;
    if (lip != IPAddress((uint32_t)0)) {
      manualOctets[0] = lip[0];
      manualOctets[1] = lip[1];
      manualOctets[2] = lip[2];
    }
  }
}

static String manualOctetsToIp() {
  char buf[16];
  snprintf(buf, sizeof(buf), "%u.%u.%u.%u", manualOctets[0], manualOctets[1], manualOctets[2], manualOctets[3]);
  return String(buf);
}

static void showHostChoice() {
  discovery.cancelSearch();
  page = Page::HostChoice;
  statusMsg = "";
  needRedraw = true;
}

static void openManualHost() {
  discovery.cancelSearch();
  loadManualOctetsFromSettings();
  manualSel = 0;
  page = Page::ManualHost;
  statusMsg = "Tap octet, use +/-";
  needRedraw = true;
}

static void startHostDiscovery() {
  found.clear();
  discovery.cancelSearch();
  discovery.beginSearch(settings.hostPort);
  page = Page::FindingHost;
  statusMsg = "Searching...";
  needRedraw = true;
}

static void finishHostDiscovery() {
  if (!found.empty()) {
    foundIndex = 0;
    settings.hostIp = found[0].ip;
    settings.hostPort = found[0].port;
    store.save(settings);
    statusMsg = "Found " + settings.hostIp;
    page = Page::Glance;
    pollIfDue(true);
  } else {
    statusMsg = "Not found";
    showHostChoice();
  }
  needRedraw = true;
}

static const char* kApNameBase = WIFI_SETUP_AP_NAME;

static String uniqueApName() {
  uint32_t id = (uint32_t)ESP.getEfuseMac();
  char buf[40];
  snprintf(buf, sizeof(buf), "%s-%04X", kApNameBase, (unsigned)(id & 0xFFFF));
  return String(buf);
}

static String uniqueHostname() {
  uint32_t id = (uint32_t)ESP.getEfuseMac();
  char buf[32];
  snprintf(buf, sizeof(buf), "esp32-solar-%06X", (unsigned)(id & 0xFFFFFF));
  return String(buf);
}

static void setBrightness(uint8_t v) {
#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
  ledcAttach(TFT_BL, 5000, 8);
  ledcWrite(TFT_BL, v);
#else
  ledcSetup(0, 5000, 8);
  ledcAttachPin(TFT_BL, 0);
  ledcWrite(0, v);
#endif
}

