jcvsite/Solar-monitoring-viewer-esp32/src/main.cpp
static void applyScreenRotation() {
  settings.screenRotation = (uint8_t)constrain(settings.screenRotation, (int)0, (int)3);
  tft.setRotation(settings.screenRotation);
  touchInputSetRotation(settings.screenRotation);
  ui.setRotation(settings.screenRotation);
}

static TouchSample lastTouch;
static uint32_t lastTouchAt = 0;
static String gPortalApName;

static void configModeCallback(WiFiManager* wm) {
  (void)wm;
  ui.drawWifiPortal(tft, gPortalApName.c_str());
}

static bool ensureWifi(bool forcePortal) {
  WiFi.mode(WIFI_STA);
  gPortalApName = uniqueApName();
  String hostname = uniqueHostname();

  String seedSsid = WIFI_SSID;
  String seedPass = WIFI_PASSWORD;
  bool seedOk = seedSsid.length() > 0 && seedSsid != "YourWiFiSSID";

  WiFiManager wm;
  wm.setDebugOutput(false);
  wm.setConfigPortalTimeout(300);
  wm.setConnectTimeout(30);
  wm.setAPCallback(configModeCallback);
  wm.setTitle("Solar Display WiFi");
  wm.setHostname(hostname.c_str());
  wm.setCustomHeadElement(
      "<meta name='viewport' content='width=device-width,initial-scale=1'>"
      "<style>"
      "body{font-family:system-ui,sans-serif;background:#111;color:#eee;padding:12px;max-width:420px;margin:auto}"
      "input,select{font-size:18px;padding:12px;width:100%;box-sizing:border-box;margin:8px 0;"
      "border-radius:8px;border:1px solid #444;background:#1c1c1e;color:#fff}"
      "button,.btn{font-size:18px;padding:12px 16px;border-radius:8px;border:0;background:#0a84ff;color:#fff;"
      "width:100%;margin-top:12px;cursor:pointer}"
      "h1{font-size:1.35rem} label{font-weight:600;display:block;margin-top:10px}"
      ".msg{padding:10px;border-radius:8px;background:#1c1c1e;margin:10px 0}"
      "</style>");

  if (forcePortal) {
    ui.drawWifiPortal(tft, gPortalApName.c_str());
    bool ok = wm.startConfigPortal(gPortalApName.c_str());
    return ok && WiFi.status() == WL_CONNECTED;
  }

  ui.drawSplash(tft, "WiFi...");
  bool ok = false;
  if (seedOk) {
    ok = wm.autoConnect(gPortalApName.c_str(), NULL);
    if (!ok) {
      WiFi.begin(seedSsid.c_str(), seedPass.c_str());
      uint32_t t0 = millis();
      while (WiFi.status() != WL_CONNECTED && millis() - t0 < 12000) delay(200);
      ok = WiFi.status() == WL_CONNECTED;
      if (!ok) {
        ui.drawWifiPortal(tft, gPortalApName.c_str());
        ok = wm.startConfigPortal(gPortalApName.c_str());
      }
    }
  } else {
    ok = wm.autoConnect(gPortalApName.c_str());
  }
  return ok && WiFi.status() == WL_CONNECTED;
}

static bool pinIsSet() { return settings.settingsPin.length() == 4; }

static void openSettingsPage() {
  if (pinIsSet() && !settingsPinUnlocked) {
    page = Page::PinUnlock;
    pinEntry = "";
    pinStatus = "Enter PIN";
    pinReturnPage = Page::Settings;
    needRedraw = true;
    return;
  }
  page = Page::Settings;
  settingsTab = SettingsTab::Connection;
  settingsPinUnlocked = true;
  pollIfDue(true);
  needRedraw = true;
}

static void handlePinPadCommon(bool forSet) {
  if (forSet) {
    if (pinEntry.length() == 0) {
      settings.settingsPin = "";
      store.save(settings);
      deviceWeb.applySettings(settings);
      pinSetPhase = 0;
      pinSetFirst = "";
      pinStatus = "PIN disabled";
      page = Page::Settings;
      needRedraw = true;
      return;
    }
    if (pinEntry.length() != 4) return;
    if (pinSetPhase == 0) {
      pinSetFirst = pinEntry;
      pinEntry = "";
      pinSetPhase = 1;
      pinStatus = "Confirm PIN";
      needRedraw = true;
      return;
    }
    if (pinEntry != pinSetFirst) {
      pinEntry = "";
      pinSetPhase = 0;
      pinSetFirst = "";
      pinStatus = "No match — retry";
      needRedraw = true;
      return;
    }
    settings.settingsPin = pinEntry;
    store.save(settings);
    deviceWeb.applySettings(settings);
    pinEntry = "";
    pinSetPhase = 0;
    pinSetFirst = "";
    pinStatus = "PIN saved";
    page = Page::Settings;
    needRedraw = true;
    return;
  }
  if (pinEntry.length() != 4) return;
  if (pinEntry == settings.settingsPin) {
    settingsPinUnlocked = true;
    pinEntry = "";
    page = pinReturnPage;
    pinStatus = "";
    needRedraw = true;
  } else {
    pinEntry = "";
    pinStatus = "Wrong PIN";
    needRedraw = true;
  }
}

static void applyHostSettingsFromConfig(const DisplayConfig& cfg) {
  bool changed = false;
  if (cfg.config_rev > settings.configRev) {
    settings.configRev = cfg.config_rev;
    changed = true;
  }
  if (settings.glanceLayout != cfg.glance_layout) {
    settings.glanceLayout = cfg.glance_layout;
    changed = true;
  }
  if (settings.themeId != cfg.theme) {
    settings.themeId = cfg.theme;
    ui.setTheme(settings.themeId);
    changed = true;
  }
  if (settings.screenRotation != cfg.rotation) {
    settings.screenRotation = cfg.rotation;
    applyScreenRotation();
    changed = true;
  }
  if (settings.brightness != cfg.brightness) {
    settings.brightness = cfg.brightness;
    setBrightness(settings.brightness);
    changed = true;
  }
  if (settings.pollMs != cfg.poll_ms) {
    settings.pollMs = cfg.poll_ms;
    changed = true;
  }
  if (settings.checkForUpdate != cfg.check_for_update) {
    settings.checkForUpdate = cfg.check_for_update;
    changed = true;
  }
  if (settings.autoInstallUpdate != cfg.auto_install_update) {
    settings.autoInstallUpdate = cfg.auto_install_update;
    changed = true;
  }
  if (settings.gridOfflineAlert != cfg.grid_offline_alert) {
    settings.gridOfflineAlert = cfg.grid_offline_alert;
    changed = true;
  }
  if (settings.useHostConfig && cfg.settings_pin != settings.settingsPin) {
    settings.settingsPin = cfg.settings_pin;
    changed = true;
  }
  gitOta.configure(settings.hostIp, settings.hostPort, settings.token, settings.checkForUpdate,
                   settings.autoInstallUpdate);
  if (changed) {
    store.save(settings);
    deviceWeb.applySettings(settings);
    needRedraw = true;
  }
  if (cfg.force_update) {
    String st;
    gitOta.installLatest(st);
    otaStatus = st;
  }
}

static void pollDisplayConfig(bool force) {
  if (!settings.useHostConfig) return;
  if (!force && millis() - lastConfigPoll < 30000) return;
  lastConfigPoll = millis();
  if (settings.hostIp.length() == 0 || WiFi.status() != WL_CONNECTED) return;
  DisplayConfig cfg;
  if (api.fetchDisplayConfig(settings.hostIp, settings.hostPort, settings.token, cfg)) {
    applyHostSettingsFromConfig(cfg);
  }
}

static void pollIfDue(bool force) {
  if (!force && millis() - lastPoll < settings.pollMs) return;
  lastPoll = millis();
  if (settings.hostIp.length() == 0 || WiFi.status() != WL_CONNECTED) return;

  if (page == Page::Glance || force) {
    GlanceData g;
    if (api.fetchGlance(settings.hostIp, settings.hostPort, settings.token, g)) {
      if (g.tz_offset_sec >= -43200 && g.tz_offset_sec <= 50400) {
        ui.syncClockTimezone(g.tz_offset_sec);
      }
      bool headerChanged = (g.clock != glance.clock) || (g.weather_enabled != glance.weather_enabled) ||
                           (g.weather_code != glance.weather_code) || (g.weather_temp != glance.weather_temp);
      if (force || !glanceVisualEqual(glance, g)) {
        glance = g;
        needRedraw = true;
      } else {
        glance = g;
        if (page == Page::Glance && headerChanged) {
          ui.refreshHeaderTime(tft, glance);
        }
      }
      lastGood = millis();
    }
  }
  if (page == Page::Bms) {
    BmsData b;
    if (api.fetchBms(settings.hostIp, settings.hostPort, settings.token, b)) {
      bms = b;
      lastGood = millis();
      needRedraw = true;
    }
  }
  if (page == Page::History) {
    HistoryData h;
    if (api.fetchHistory(settings.hostIp, settings.hostPort, settings.token, 24, h)) {
      history = h;
      lastGood = millis();
      needRedraw = true;
    }
  }
}

static bool pollTouch(TouchSample& s) {
  static uint32_t lastScan = 0;
  if (millis() - lastScan < 25) return false;
  lastScan = millis();
  if (!touchInputSample(s)) return false;
  lastTouch = s;
  lastTouchAt = millis();
  return true;
}

