jcvsite/Solar-monitoring-viewer-esp32/src/main.cpp
static void handleTouch() {
  TouchSample s;
  static uint32_t lastTap = 0;
  if (!pollTouch(s)) return;
  if (millis() - lastTap < 300) return;
  lastTap = millis();

  int16_t x = s.x;
  int16_t y = s.y;
  uint8_t rot = settings.screenRotation;
  int sh = scrH(rot);

  Page navPage;
  if (ui.navPageAt(x, y, navPage, rot) && (uint8_t)page <= (uint8_t)Page::Settings) {
    if (navPage == Page::Settings) {
      openSettingsPage();
      return;
    }
    settingsPinUnlocked = false;
    page = navPage;
    settingsTab = SettingsTab::Connection;
    pollIfDue(true);
    needRedraw = true;
    return;
  }

  if (page == Page::HostChoice) {
    if (y >= 120 && y <= 192) {
      startHostDiscovery();
      return;
    }
    if (y >= 210 && y <= 282) {
      openManualHost();
      return;
    }
    return;
  }

  if (page == Page::FindingHost) {
    if (y >= 210 && y <= 260) {
      showHostChoice();
      return;
    }
    return;
  }

  if (page == Page::ManualHost) {
    int w = scrW(rot);
    const int octX[4] = {8, 66, 124, 182};
    for (int i = 0; i < 4; i++) {
      if (y >= 52 && y <= 92 && x >= octX[i] && x <= octX[i] + 48) {
        manualSel = (uint8_t)i;
        needRedraw = true;
        return;
      }
    }
    if (y >= 110 && y <= 150 && x >= 15 && x <= 75) {
      manualOctets[manualSel] = (manualOctets[manualSel] == 0) ? 255 : manualOctets[manualSel] - 1;
      needRedraw = true;
      return;
    }
    if (y >= 110 && y <= 150 && x >= w - 75 && x <= w - 15) {
      manualOctets[manualSel] = (manualOctets[manualSel] == 255) ? 0 : manualOctets[manualSel] + 1;
      needRedraw = true;
      return;
    }
    if (y >= 165 && y <= 195 && x >= 15 && x <= 75) {
      if (settings.hostPort > 1) settings.hostPort--;
      needRedraw = true;
      return;
    }
    if (y >= 165 && y <= 195 && x >= w - 75 && x <= w - 15) {
      if (settings.hostPort < 65535) settings.hostPort++;
      needRedraw = true;
      return;
    }
    if (y >= 205 && y <= 239 && x >= 10 && x <= w / 2 - 5) {
      String ip = manualOctetsToIp();
      statusMsg = "Testing...";
      needRedraw = true;
      ui.drawManualHost(tft, manualOctets, manualSel, settings.hostPort, statusMsg);
      String title;
      if (api.probeHost(ip, settings.hostPort, settings.token, title)) {
        statusMsg = title.length() ? title : "Host OK";
      } else {
        statusMsg = "Not reachable";
      }
      needRedraw = true;
      return;
    }
    if (y >= 205 && y <= 239 && x >= w / 2 + 5 && x <= w - 10) {
      settings.hostIp = manualOctetsToIp();
      store.save(settings);
      deviceWeb.applySettings(settings);
      statusMsg = "Saved";
      page = Page::Glance;
      pollIfDue(true);
      needRedraw = true;
      return;
    }
    if (y >= 248 && y <= 282 && x >= 10 && x <= w - 10) {
      page = settings.hostIp.length() ? Page::Settings : Page::HostChoice;
      statusMsg = "";
      needRedraw = true;
      return;
    }
    return;
  }

  if (page == Page::PickLayout) {
    int idx = 0;
    if (ui.pickListAt(x, y, 36, 5, idx, rot)) {
      settings.glanceLayout = (uint8_t)idx;
      store.save(settings);
      page = Page::Settings;
      needRedraw = true;
      return;
    }
    if (y >= sh - 40) {
      page = Page::Settings;
      needRedraw = true;
    }
    return;
  }

  if (page == Page::PickTheme) {
    int idx = 0;
    if (ui.pickListAt(x, y, 36, 5, idx, rot)) {
      settings.themeId = (uint8_t)idx;
      ui.setTheme(settings.themeId);
      store.save(settings);
      page = Page::Settings;
      needRedraw = true;
      return;
    }
    if (y >= sh - 40) {
      page = Page::Settings;
      needRedraw = true;
    }
    return;
  }

  if (page == Page::Settings || page == Page::SettingsConn || page == Page::SettingsUpdates) {
    SettingsTab tab;
    if (ui.settingsTabAt(x, y, tab, rot)) {
      settingsTab = tab;
      needRedraw = true;
      return;
    }

    if (settingsTab == SettingsTab::Connection) {
      if (y >= 122 && y <= 150 && x >= 8 && x <= scrW(rot) - 8) {
        settings.screenRotation = (settings.screenRotation + 1) & 3;
        store.save(settings);
        applyScreenRotation();
        statusMsg = rotationLabel(settings.screenRotation);
        needRedraw = true;
        return;
      }
      if (y >= 154 && y <= 182) {
        page = Page::PickLayout;
        needRedraw = true;
        return;
      }
      if (y >= 186 && y <= 214) {
        page = Page::PickTheme;
        needRedraw = true;
        return;
      }
      if (y >= 218 && y <= 246 && x >= 8 && x <= scrW(rot) - 8) {
        page = Page::PinSet;
        pinSetPhase = 0;
        pinSetFirst = "";
        pinEntry = "";
        pinStatus = "New PIN (4 digits)";
        needRedraw = true;
        return;
      }
      int w = scrW(rot);
      int cardW = w - 16;
      if (y >= 248 && y <= 272 && x >= 8 && x <= 8 + cardW / 2 - 4) {
        startHostDiscovery();
        return;
      }
      if (y >= 248 && y <= 272 && x >= 8 + cardW / 2 + 4) {
        openManualHost();
        return;
      }
      if (y >= 276 && y <= 300) {
        page = Page::WifiPick;
        startWifiScan();
        return;
      }
    } else {
      if (y >= 140 && y <= 168) {
        settings.checkForUpdate = !settings.checkForUpdate;
        if (!settings.checkForUpdate) settings.autoInstallUpdate = false;
        store.save(settings);
        gitOta.configure(settings.hostIp, settings.hostPort, settings.token, settings.checkForUpdate,
                         settings.autoInstallUpdate);
        needRedraw = true;
        return;
      }
      if (y >= 172 && y <= 200) {
        settings.autoInstallUpdate = !settings.autoInstallUpdate;
        if (settings.autoInstallUpdate) settings.checkForUpdate = true;
        store.save(settings);
        gitOta.configure(settings.hostIp, settings.hostPort, settings.token, settings.checkForUpdate,
                         settings.autoInstallUpdate);
        needRedraw = true;
        return;
      }
      if (y >= 204 && y <= 232) {
        settings.gridOfflineAlert = !settings.gridOfflineAlert;
        store.save(settings);
        needRedraw = true;
        return;
      }
      if (y >= 236 && y <= 264) {
        settings.useHostConfig = !settings.useHostConfig;
        store.save(settings);
        if (settings.useHostConfig) pollDisplayConfig(true);
        needRedraw = true;
        return;
      }
    }
  }

