jcvsite/Solar-monitoring-viewer-esp32/src/main.cpp
  if (page == Page::WifiPick) {
    int idx = 0;
    bool rescan = false;
    bool phone = false;
    bool back = false;
    if (ui.wifiNetworkAt(x, y, wifiScroll, (int)wifiNets.size(), idx, rescan, phone, back, rot)) {
      if (back) {
        page = Page::Settings;
        statusMsg = wifiStatus;
        needRedraw = true;
        return;
      }
      if (rescan) {
        startWifiScan();
        return;
      }
      if (phone) {
        statusMsg = "Opening phone portal...";
        needRedraw = true;
        if (ensureWifi(true)) {
          statusMsg = "WiFi OK " + WiFi.localIP().toString();
          page = Page::Settings;
        } else {
          statusMsg = "Portal cancelled";
        }
        needRedraw = true;
        return;
      }
      if (idx >= 0 && idx < (int)wifiNets.size()) {
        wifiSelected = idx;
        wifiPickSsid = wifiNets[idx].ssid;
        if (!wifiNets[idx].secure) {
          if (connectPickedWifi(wifiPickSsid, "")) {
            statusMsg = wifiStatus;
            page = settings.hostIp.length() ? Page::Glance : Page::HostChoice;
          } else {
            page = Page::WifiPick;
          }
        } else {
          wifiPassword = "";
          wifiShowPass = false;
          wifiShift = false;
          wifiStatus = "Enter password";
          page = Page::WifiPassword;
        }
        needRedraw = true;
      }
    }
    return;
  }

  if (page == Page::WifiPassword) {
    char ch = 0;
    bool backspace = false;
    bool shiftKey = false;
    bool space = false;
    bool showPass = false;
    bool connect = false;
    bool back = false;
    if (ui.wifiPasswordAt(x, y, wifiShift, ch, backspace, shiftKey, space, showPass, connect, back, rot)) {
      if (back) {
        page = Page::WifiPick;
        wifiStatus = "Tap your network";
        needRedraw = true;
        return;
      }
      if (shiftKey) {
        wifiShift = !wifiShift;
        needRedraw = true;
        return;
      }
      if (showPass) {
        wifiShowPass = !wifiShowPass;
        needRedraw = true;
        return;
      }
      if (backspace && wifiPassword.length()) {
        wifiPassword.remove(wifiPassword.length() - 1);
        needRedraw = true;
        return;
      }
      if (space) {
        wifiPassword += ' ';
        needRedraw = true;
        return;
      }
      if (ch) {
        if (wifiPassword.length() < 63) wifiPassword += ch;
        needRedraw = true;
        return;
      }
      if (connect) {
        if (connectPickedWifi(wifiPickSsid, wifiPassword)) {
          statusMsg = wifiStatus;
          page = settings.hostIp.length() ? Page::Glance : Page::HostChoice;
        } else {
          page = Page::WifiPassword;
        }
        needRedraw = true;
        return;
      }
    }
    return;
  }

  if (page == Page::PinUnlock || page == Page::PinSet) {
    int digit = -1;
    bool del = false;
    bool ok = false;
    bool back = false;
    if (ui.pinPadAt(x, y, digit, del, ok, back, rot)) {
      if (back) {
        pinEntry = "";
        page = (page == Page::PinSet) ? Page::Settings : Page::Glance;
        needRedraw = true;
        return;
      }
      if (del && pinEntry.length()) {
        pinEntry.remove(pinEntry.length() - 1);
        needRedraw = true;
        return;
      }
      if (digit >= 0 && pinEntry.length() < 4) {
        pinEntry += String(digit);
        needRedraw = true;
        if (pinEntry.length() == 4 && ok) handlePinPadCommon(page == Page::PinSet);
        return;
      }
      if (ok) {
        if (page == Page::PinSet && pinEntry.length() == 0) {
          handlePinPadCommon(true);
          return;
        }
        if (pinEntry.length() == 4) handlePinPadCommon(page == Page::PinSet);
        return;
      }
    }
    return;
  }
}

void setup() {
  Serial.begin(115200);
  delay(200);
  store.begin();
  settings = store.load();

  themeSetActive(settings.themeId);
  touchInputBegin();

  tft.init();
  applyScreenRotation();
  ui.setTheme(settings.themeId);
  setBrightness(settings.brightness);
  ui.begin(tft);
  ui.drawSplash(tft, "Starting...");

  gitOta.begin();
  gitOta.configure(settings.hostIp, settings.hostPort, settings.token, settings.checkForUpdate,
                   settings.autoInstallUpdate);

  if (ensureWifi(false)) {
    ui.drawSplash(tft, WiFi.localIP().toString().c_str());
    deviceWeb.applySettings(settings);
    deviceWeb.begin();
    ui.ensureClock();
    {
      struct tm ti;
      uint32_t t0 = millis();
      while (millis() - t0 < 3000) {
        if (getLocalTime(&ti)) break;
        delay(200);
      }
    }
    delay(400);
  } else {
    page = Page::WifiPick;
    startWifiScan();
    delay(400);
  }

  if (page != Page::WifiPick && page != Page::WifiPassword) {
    page = Page::Glance;
    statusMsg = settings.hostIp;
  }

  pollDisplayConfig(true);
  pollIfDue(true);
  needRedraw = true;
}

void loop() {
  handleTouch();

  if (gDeviceWebSaved) {
    gDeviceWebSaved = false;
    settings = deviceWeb.settings();
    store.save(settings);
    applyScreenRotation();
    ui.setTheme(settings.themeId);
    setBrightness(settings.brightness);
    needRedraw = true;
  }

  deviceWeb.loop();
  gitOta.loop();
  otaStatus = gitOta.status();

  if (page == Page::FindingHost && discovery.isSearching()) {
    if (discovery.tickSearch(api, settings.token, found)) {
      finishHostDiscovery();
    }
  }

  static bool wasStale = false;
  bool stale = (lastGood == 0) || (millis() - lastGood > STALE_MS);
  if (stale != wasStale) {
    wasStale = stale;
    needRedraw = true;
  }

  pollIfDue(false);
  pollDisplayConfig(false);

  static uint32_t lastClock = 0;
  if (page == Page::Glance && WiFi.status() == WL_CONNECTED && millis() - lastClock >= 30000) {
    lastClock = millis();
    ui.ensureClock();
    ui.refreshHeaderTime(tft, glance);
  }

  if (page == Page::Glance && glanceGridAlert(glance) && millis() - lastAnim >= 500) {
    lastAnim = millis();
    ui.drawGlanceGridPulse(tft, glance, millis(), settings.gridOfflineAlert);
  }

  if (needRedraw) {
    needRedraw = false;
    switch (page) {
      case Page::Glance:
        ui.drawGlance(tft, glance, stale, millis(), settings.glanceLayout, settings.gridOfflineAlert);
        break;
      case Page::Bms:
        ui.drawBms(tft, bms);
        break;
      case Page::History:
        ui.drawHistory(tft, history);
        break;
      case Page::Settings:
      case Page::SettingsConn:
      case Page::SettingsUpdates:
        ui.drawSettings(tft, settings, WiFi.status() == WL_CONNECTED, WiFi.SSID(),
                        settingsTab == SettingsTab::Updates ? otaStatus : statusMsg, settingsTab);
        break;
      case Page::PickLayout:
        ui.drawPickList(tft, "Layout", kLayoutNames, 5, settings.glanceLayout);
        break;
      case Page::PickTheme:
        ui.drawPickList(tft, "Theme", kThemeNames, 5, settings.themeId);
        break;
      case Page::FindingHost:
        ui.drawFindingHost(tft, statusMsg);
        break;
      case Page::HostChoice:
        ui.drawHostChoice(tft, WiFi.SSID());
        break;
      case Page::ManualHost:
        ui.drawManualHost(tft, manualOctets, manualSel, settings.hostPort, statusMsg);
        break;
      case Page::WifiPick:
        ui.drawWifiNetworks(tft, wifiNets, wifiScroll, wifiSelected, wifiStatus);
        break;
      case Page::WifiPassword:
        ui.drawWifiPassword(tft, wifiPickSsid, wifiPassword, wifiShowPass, wifiShift, wifiStatus);
        break;
      case Page::PinUnlock:
        ui.drawPinPad(tft, "Settings locked", pinEntry, "Enter 4-digit PIN", pinStatus);
        break;
      case Page::PinSet:
        ui.drawPinPad(tft, "Settings PIN", pinEntry, pinSetPhase ? "Confirm PIN" : "New PIN (4 digits)", pinStatus);
        break;
    }
  }

#if TOUCH_SHOW_DEBUG
  if (lastTouch.active && millis() - lastTouchAt < 3000) {
    ui.drawTouchDebug(tft, lastTouch);
  }
#endif

  delay(20);
}
